
** Script.py

#+begin_src python :results output
  import pandas as pd

  #sneak peek at the data
  df = pd.read_csv('student_math.csv')
  print(df.columns, df.shape)

  #set predictors and outcome variables
  y = df['Final_Grade']
  X = df.drop(columns = ['Final_Grade'])

  #perform a train-test-split
  from sklearn.model_selection import train_test_split

  X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

  #fit a Lasso regularized regression model
  from sklearn.linear_model import Lasso

  lasso = Lasso(alpha = 0.05)
  lasso.fit(X_train, y_train)

  #Mean Squared Error (MSE)
  from sklearn.metrics import mean_squared_error

  pred_train = lasso.predict(X_train)
  pred_test = lasso.predict(X_test)
  training_mse = mean_squared_error(y_train, pred_train)
  test_mse = mean_squared_error(y_test, pred_test)
  print('Training Error: ', training_mse)
  print('Test Error: ', test_mse)

  #Potential values for alpha are an array between 0.000001 and 1.0
  import numpy as np

  alpha_array = np.logspace(-6, 0, 100)

  #dict with key (alpha) and values being alpha_array
  tuned_parameters = [{'alpha': alpha_array}]

  #implementing different values of alpha and multiple train-test splits
  from sklearn.model_selection import GridSearchCV

  model = GridSearchCV(estimator=Lasso(),
       param_grid = tuned_parameters, scoring =  'neg_mean_squared_error', cv = 5, return_train_score = True)
  model.fit(X, y)

  #mean train and test scores across the 5 train-test splits
  test_scores = model.cv_results_['mean_test_score']
  train_scores = model.cv_results_['mean_train_score']

  #alpha that is optimal to our scoring strategy
  print(model.best_params_, model.best_score_)

#+end_src

#+RESULTS:
#+begin_example
Index(['age', 'Medu', 'Fedu', 'traveltime', 'studytime', 'failures', 'famrel',
       'freetime', 'goout', 'Dalc', 'Walc', 'health', 'absences', 'G1', 'G2',
       'Final_Grade', 'school_MS', 'sex_M', 'address_U', 'famsize_LE3',
       'Pstatus_T', 'Mjob_health', 'Mjob_other', 'Mjob_services',
       'Mjob_teacher', 'Fjob_health', 'Fjob_other', 'Fjob_services',
       'Fjob_teacher', 'reason_home', 'reason_other', 'reason_reputation',
       'guardian_mother', 'guardian_other', 'schoolsup_yes', 'famsup_yes',
       'paid_yes', 'activities_yes', 'nursery_yes', 'higher_yes',
       'internet_yes', 'romantic_yes'],
      dtype='object') (395, 42)
Training Error:  2.8132075838851405
Test Error:  4.474769444129441
{'alpha': 0.12328467394420659} -3.743294901559115
#+end_example
